fustyles/Arduino/ESP32-CAM_Car/ESP32-CAM_CAR_2pwm_knn-classifier/app_httpd.cpp
          function saveModel() {
            let dataset = classifier.getClassifierDataset();
            let myDataset = {}
            Object.keys(dataset).forEach((key) => {
              let data = dataset[key].dataSync();
              myDataset[key] = Array.from(data);
            });
            let json = JSON.stringify(myDataset)
            
            var link = document.createElement('a');
            link.download="model.json";
            link.href='data:text/text;charset=utf-8,' + encodeURIComponent(json);
            document.body.appendChild(link);
            link.click();
            link.remove();
          }
          
          getModel.onchange = function (event) {
            var target = event.target || window.event.srcElement;
            var files = target.files;
            var fr = new FileReader();
            if (files.length>0) {
                fr.onload = function () {     
                  var dataset = fr.result;
                  var myDataset = JSON.parse(dataset)
                  Object.keys(myDataset).forEach((key) => {
                    myDataset[key] = tf.tensor(myDataset[key], [myDataset[key].length / 1024, 1024]);
                  })
                  classifier.setClassifierDataset(myDataset);
                }
                fr.readAsText(files[0]);
              }
            }
      
            stream.onload = function (event) {
              if (document.getElementById('startdetection').checked) {
                predictClass_onclick();
              }
              if (mobilenetModule) {
                try { 
                  document.createEvent("TouchEvent");
                  setTimeout(function(){getStill.click();},250);
                }
                catch(e) { 
                  setTimeout(function(){getStill.click();},150);
                } 
              }
            }
        </script>
    </body>
</html>
)rawliteral";

static esp_err_t index_handler(httpd_req_t *req){
    httpd_resp_set_type(req, "text/html");
    //httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
    //return httpd_resp_send(req, (const char *)index_html_gz, index_html_gz_len);
    return httpd_resp_send(req, (const char *)INDEX_HTML, strlen(INDEX_HTML));
}

void startCameraServer(){
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();

    httpd_uri_t index_uri = {
        .uri       = "/",
        .method    = HTTP_GET,
        .handler   = index_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t status_uri = {
        .uri       = "/status",
        .method    = HTTP_GET,
        .handler   = status_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t cmd_uri = {
        .uri       = "/control",
        .method    = HTTP_GET,
        .handler   = cmd_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t capture_uri = {
        .uri       = "/capture",
        .method    = HTTP_GET,
        .handler   = capture_handler,
        .user_ctx  = NULL
    };

   httpd_uri_t stream_uri = {
        .uri       = "/stream",
        .method    = HTTP_GET,
        .handler   = stream_handler,
        .user_ctx  = NULL
    };


    ra_filter_init(&ra_filter, 20);
    
    mtmn_config.min_face = 80;
    mtmn_config.pyramid = 0.7;
    mtmn_config.p_threshold.score = 0.6;
    mtmn_config.p_threshold.nms = 0.7;
    mtmn_config.r_threshold.score = 0.7;
    mtmn_config.r_threshold.nms = 0.7;
    mtmn_config.r_threshold.candidate_number = 4;
    mtmn_config.o_threshold.score = 0.7;
    mtmn_config.o_threshold.nms = 0.4;
    mtmn_config.o_threshold.candidate_number = 1;
    
    face_id_init(&id_list, FACE_ID_SAVE_NUMBER, ENROLL_CONFIRM_TIMES);
    
    Serial.printf("Starting web server on port: '%d'\n", config.server_port);
    if (httpd_start(&camera_httpd, &config) == ESP_OK) {
        httpd_register_uri_handler(camera_httpd, &index_uri);
        httpd_register_uri_handler(camera_httpd, &cmd_uri);
        httpd_register_uri_handler(camera_httpd, &status_uri);
        httpd_register_uri_handler(camera_httpd, &capture_uri);
    }

    config.server_port += 1;
    config.ctrl_port += 1;
    Serial.printf("Starting stream server on port: '%d'\n", config.server_port);
    if (httpd_start(&stream_httpd, &config) == ESP_OK) {
        httpd_register_uri_handler(stream_httpd, &stream_uri);
    }
}
